In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
con = engine.connect()
engine = create_engine("mysql+pymysql://root:@localhost:3306/portfolio_development")
conpf = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

In [2]:
name = "SF"

### MySQL Stock Database

In [3]:
sql = '''
DELETE FROM price
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM price
WHERE name = "SF"

In [4]:
rp = con.execute(sql)
rp.rowcount

1469

In [5]:
sql = '''
DELETE FROM nameall
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM nameall
WHERE name = "SF"

In [6]:
rp = con.execute(sql)
rp.rowcount

1

In [7]:
sql = '''
DELETE FROM stockname
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM stockname
WHERE name = "SF"

In [8]:
rp = con.execute(sql)
rp.rowcount

1

### PostgreSQL PortPg Database

In [9]:
sql = """
SELECT * FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

SELECT * FROM yr_profits
WHERE name = 'SF'

In [10]:
df = pd.read_sql(sql, conpg)
df

,id,name,year,quarter,latest_amt,previous_amt,inc_amt,inc_pct,ticker_id
0,2029703,SF,2013,2,443489,1717858,-1274369,-74.183605,444
1,2029702,SF,2014,2,565410,443489,121921,27.491324,444
2,2029701,SF,2015,2,783204,565410,217794,38.519658,444
3,2029700,SF,2015,3,816737,600998,215739,35.896792,444
4,2029699,SF,2016,1,1512067,759408,752659,99.111281,444
5,2029698,SF,2016,2,1527604,783204,744400,95.045480,444
6,2029697,SF,2016,3,1577131,816737,760394,93.101451,444
7,2029696,SF,2016,4,963977,1407831,-443854,-31.527506,444
8,2029695,SF,2017,1,901235,1512067,-610832,-40.397152,444
9,2029694,SF,2017,2,935540,1527604,-592064,-38.757689,444
10,2029693,SF,2017,3,1017346,1577131,-559785,-35.493881,444
11,2029692,SF,2017,4,1841096,963977,877119,90.989619,444
12,2029691,SF,2018,1,1856642,901235,955407,106.010863,444
13,2029690,SF,2018,2,1832580,935540,897040,95.884730,444
14,2029689,SF,2018,3,1845621,1017346,828275,81.415271,444
15,2029688,SF,2018,4,1653713,1841096,-187383,-10.177796,444
16,2029687,SF,2019,1,1657394,1856642,-199248,-10.730000,444
17,2029686,SF,2019,2,1785488,1832580,-47092,-2.569710,444
18,2029685,SF,2019,3,1762469,1845621,-83152,-4.505367,444
19,2029684,SF,2019,4,2031351,1653713,377638,22.835764,444
20,2029683,SF,2020,1,2068259,1657394,410865,24.790000,444
21,2029682,SF,2020,2,2060830,1785488,275342,15.421106,444
22,2029681,SF,2020,3,2015228,1762469,252759,14.341188,444
23,2029680,SF,2020,4,2083273,2031351,51922,2.556033,444
24,2029679,SF,2021,1,2085927,2068259,17668,0.850000,444
25,2029678,SF,2021,2,2214881,2060830,154051,7.475192,444
26,2029677,SF,2021,3,2069519,2015228,54291,2.690000,444
27,2029676,SF,2021,4,1332210,2083273,-751063,-36.050000,444
28,2029675,SF,2022,1,1458525,2085927,-627402,-30.080000,444

In [11]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'SF'

In [12]:
rp = conpg.execute(sql)
rp.rowcount

29

In [13]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'SF'

In [14]:
rp = conpg.execute(sql)
rp.rowcount

45

In [15]:
sql = """
DELETE FROM consensus
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM consensus
WHERE name = 'SF'

In [16]:
rp = conpg.execute(sql)
rp.rowcount

1

In [17]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'SF'

In [18]:
rp = conpg.execute(sql)
rp.rowcount

1

In [19]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'SF'

In [20]:
rp = conpg.execute(sql)
rp.rowcount

1

### SQLite PortMy Database

In [21]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'SF'

In [22]:
rp = conmy.execute(sql)
rp.rowcount

1

In [23]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'SF'

In [24]:
rp = conmy.execute(sql)
rp.rowcount

1

### SQLite PortLt Database

In [25]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'SF'

In [26]:
rp = conlt.execute(sql)
rp.rowcount

29

In [27]:
sql = """
DELETE FROM qt_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM qt_profits
WHERE name = 'SF'

In [28]:
rp = conlt.execute(sql)
rp.rowcount

27

In [29]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'SF'

In [30]:
rp = conlt.execute(sql)
rp.rowcount

45

In [31]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'SF'

In [32]:
rp = conlt.execute(sql)
rp.rowcount

1

In [33]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'SF'

In [34]:
rp = conlt.execute(sql)
rp.rowcount

1

### MySQL Portfolio Database

In [35]:
sql = """
SELECT * FROM stocks
WHERE name = '%s'
"""
sql = sql % name
df = pd.read_sql(sql, conpf)
df

    id name  category_id website
0  168   SF            3

### Delete from name-ttl.csv manually